tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "gallo-s-chingon/slugged"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "wabarc/wayback"
brew "glib"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "sqlite"
brew "aria2"
brew "ata"
brew "atuin", restart_service: :changed
brew "autoconf"
brew "automake"
brew "awk"
brew "ncurses"
brew "bash"
brew "bat"
brew "brightness"
brew "btop"
brew "c2048"
brew "carapace"
brew "clipboard"
brew "cmake"
brew "coreutils"
brew "curl"
brew "ddh"
brew "doxygen"
brew "dust"
brew "eza"
brew "f2"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gcc@12"
brew "gdbm"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "libevent"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "grex"
brew "grokj2k"
brew "gtk+3"
brew "helm"
brew "hugo"
brew "libtool"
brew "imagemagick"
brew "instaloader"
brew "ipython"
brew "jj"
brew "jump"
brew "perl"
brew "latexindent"
brew "lazygit"
brew "libarchive"
brew "libffi"
brew "libtorrent-rasterbar"
brew "libyaml"
brew "ltex-ls"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mailsy"
brew "make"
brew "markdown-oxide"
brew "marksman"
brew "mas"
brew "mdp"
brew "media-info"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "netcat"
brew "ninja"
brew "ollama"
brew "openai-whisper"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pdf2svg"
brew "pianobar"
brew "pipx"
brew "pngpaste"
brew "procs"
brew "pygobject3"
brew "python-build"
brew "qpdf"
brew "r"
brew "rclone"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "ruby@3.2"
brew "ruff"
brew "rust"
brew "rustup"
brew "sd"
brew "shellcheck"
brew "sk"
brew "starship"
brew "tealdeer"
brew "tinymist"
brew "tree"
brew "tty-clock"
brew "typst"
brew "universal-ctags"
brew "wget"
brew "yazi"
brew "yq"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "asmvik/formulae/yabai"
brew "felixkratz/formulae/sketchybar"
cask "affinity"
cask "alt-tab"
cask "balenaetcher"
cask "bettertouchtool"
cask "claude"
cask "discord"
cask "font-fragment-mono"
cask "font-ibm-plex-mono"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "hiddenbar"
cask "homerow"
cask "iina"
cask "itsycal"
cask "keycastr"
cask "kitty"
cask "lulu"
cask "name-mangler"
cask "obsidian"
cask "raycast"
cask "ripme"
cask "slack"
cask "spotify"
cask "temurin"
cask "via"
cask "whatsapp"
cask "zoom"
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
cargo "ast-grep"
cargo "choose"
cargo "difftastic"
cargo "kanata"
cargo "xq"
